<template>
    <main class="main">
        <Breadcrumbs/>
        <div class="deleg">
            <div class="container">
                <div class="deleg__inner">
                    <h5 class="deleg__title">Делегирование</h5>
                    <div class="deleg-content">
                        <p class="deleg-content__text"><b>Делегирование</b> – это передача подчиненному задачи и деятельности  из сферы действий руководителя. Одновременно с рабочей задачей для ее выполнения должны также делегироваться необходимые полномочия и ответственность.</p>
                        <p class="deleg-content__text"><b>Полномочия</b> – это ограниченное право использовать ресурсы организации или конкретного человека и направлять усилия подчиненных на выполнение определенных задач.</p>
                        <p class="deleg-content__text">В отличие от обычного распределения обязанностей при делегировании сотруднику, как правило, поручают задачу, с которой обычно справляется руководитель.</p>
                        <p class="deleg-content__text">Ответственность  должна быть определена как можно точнее за каждый участок работы. (Как правило, это делается с помощью должностных инструкций, поэтому в интересах руководителя составлять не формальные, а реальные инструкции). </p>
                        <p class="deleg-content__text">Например, для предстоящей встрече с партнерами руководителю нужно подготовить презентацию — он продумывает содержание и все детали, а задачу по оформлению делегирует одному из сотрудников. Умелое делегирование помогает распределять нагрузку в команде и освобождать время для работы над важными проектами.</p>
                        <h6 class="deleg-content__title">Что нельзя делегировать:</h6>
                        <ul class="deleg-content__list">
                            <li>Планирование основной деятельности;</li>
                            <li>Подбор команды исполнителей;</li>
                            <li>Задачи особой значимости и важности, высокой степени риска и строгого доверительного, конфиденциального характера;</li>
                            <li>Контроль за работой команды;</li>
                            <li>Оценка членов команды;</li>
                            <li>Стимулирование членов команды и вознаграждение членов команды.</li>
                        </ul>
                        <h6 class="deleg-content__title">Что можно и нужно делегировать:</h6>
                        <ul class="deleg-content__list">
                            <li>Рутинную работу, Несложные для сотрудников задачи, занимающие у руководителя много времени и отвлекающие от стратегической работы. Например, бронирование номеров для проживания делегации или командировочных, регистрация компании на бизнес-мероприятиях.</li>
                            <li>Задачи, выполнению которых можно легко обучить сотрудника. Например, сбор информации о конкурентах или подготовка официальных запросов в государственные инстанции.</li>
                            <li>Подготовительные и специальные операции (сбор информации, обработка данных, подготовка анализа);</li>
                            <li>Средне- и долгосрочные задачи руководителя, которые могут мотивировать подчиненного и способствовать его профессиональному развитию.</li>
                            <li>Задачи, где компетенций руководителя может быть недостаточно и нужно привлечь экспертного в этой отрасли сотрудника, например, data-анализ или работы по созданию сайта-визитки для компании.</li>
                            <li>Задачи, пересекающиеся с другими важными процессами и мешающие их исполнению. К примеру, когда руководитель находится в отъезде, кто-то из сотрудников должен коммуницировать с клиентами вместо него, решать рабочие вопросы.</li>
                            <li>Дела, которые сотрудник выполняет с удовольствием</li>
                            <li>Частные вопросы;</li>
                        </ul>
                        <h6 class="deleg-content__title">
                            Почему важно научиться правильно делегировать? 
                        </h6>
                        <ul class="deleg-content__list">
                            <li>Во-первых, так управленец сможет снять с себя часть рутинной работы и освободить время для разработки стратегии масштабирования бизнеса. </li>
                            <li>Во-вторых, умелое делегирование помогает минимизировать вероятность срыва дедлайнов и повысить продуктивность организации в целом, а также каждого сотрудника в отдельности.</li>
                        </ul>
                        <!-- тут должно быть аудио -->
                    </div>
                    <div class="time__btns">
                        <light-button 
                            class="time__btns-light"
                            @click="router.push('/models')"
                            >вернуться
                        </light-button>
                        <my-button 
                            class="time__btns-dark"
                            @click="router.push('/test-1')"
                            >продолжить
                        </my-button>
                    </div>
                </div>
            </div>
        </div>
        <Navbar/>
    </main>
</template>

<script setup>
import Navbar from '@/components/Navbar.vue';
import Breadcrumbs from '@/components/Breadcrumbs.vue';
import { useRouter } from 'vue-router';
const router = useRouter();
</script>

<style lang="scss" scoped>
.deleg{
    padding: 14px 0 80px;
    background-color: #fff;

    &__inner{
        display: flex;
        flex-direction: column;
        gap: 30px;
    }

    &__title{
        text-align: center;
        font-weight: 500;
        font-size: 16px;
    }

}

.deleg-content{
    display: flex;
    flex-direction: column;
    gap: 8px;

    &__text{
        font-weight: 400;
        font-size: 14px;
    }

    &__title{
        font-weight: 500;
    }

    &__img{
        width: 100%;
    }

    &__list{
        display: flex;
        flex-direction: column;
        gap: 5px;
        padding-left: 40px;

        li{
            font-weight: 400;
            font-size: 14px;
        }
    }
}
</style>