<template>
    <main class="main">
        <Breadcrumbs/>
        <div class="roles">
            <div class="container">
                <div class="roles__inner">
                    <h5 class="roles__title">Роли в команде</h5>
                    <div class="roles-content">
                        <p class="roles-content__text">Любая команда – это набор ролей.
                            Ролевых моделей много, ролевые модели разные.
                        </p>
                        <p class="roles-content__text"><b>Видов ролей несколько. Условно их можно поделить на 4 типа:</b>
                            Функциональные – роли с точки зрения наших должностных обязанностей,
                        </p>
                        <p class="roles-content__text"> Процессные – роли с точки зрения конкретного процесса, например, scrum-мастер в проекте, интервьюер в процессе найма и т.д.</p>
                        <p class="roles-content__text"> Социальные – роли во взаимодействии с другими людьми: коллега, друг, сокомандник и т.д.</p>
                        <p class="roles-content__text">Командные – роли, которые необходимы в команде для реализации поставленных задач.</p>
                        <p class="roles-content__text"><b>Ролевая модель Белбина</b>
                            Рэймонд Мередит Белбин, доктор психологических наук и директор Belbin Associates Ltd, в 60–70-х годах создал теоретическую модель командных ролей. 
                        </p>
                        <p class="roles-content__text">Главная идея модели: рабочая команда наиболее эффективна, когда состоит из людей с разными способностями, образами мышления и личностными качествами. При этом важно, чтобы члены команды не просто отличались, а дополняли друг друга. Тогда процесс заработает по принципу конвейера, где каждый сотрудник исполняет свои конкретные функции в проекте, а затем передаёт его дальше, по цепочке.
                        </p>
                        <p class="roles-content__text">Она состоит из 9-ти ролей и поделена на 3 группы: Интеллектуальные роли.</p>
                        <ul class="roles-content__list">
                            <li>Генератор идей - создает новые идеи (в отличие от исследователя, свои собственные, ну или думает, что свои собственные)</li>
                            <li>Аналитик-стратег- ищет истину, фильтрует все идеи</li>
                            <li>Специалист - эксперт, знает, как надо правильно</li>
                        </ul>
                        <p class="roles-content__text">Социальные роли.</p>
                        <ul class="roles-content__list">
                            <li>Душа команды -  просто приятный чувак, налаживает отношения внутри команды</li>
                            <li>Исследователь ресурсов - налаживает контакты с внешним миром и приносит оттуда новые идеи</li>
                            <li>Координатор - заставляет всех работать вместе, раздает указания</li>
                        </ul>
                        <p class="roles-content__text">Роли действия. </p>
                        <ul class="roles-content__list">
                            <li>Мотиватор - всех вдохновляет что-то делать</li>
                            <li>Реализатор - просто делает, превращает идеи в результаты</li>
                            <li>Педант - доводит дело до конца, перфекционирует</li>
                            <li>Идеально, когда в команде есть все эти роли.Но это, скажем прямо, редкость.Нужно добиваться того, чтобы были представлены хотя бы самые необходимые.</li>
                        </ul>
                        <ul class="roles-content__list">
                            <li>Белбин считал, что таковых 5:</li>
                            <li>Мотиватор</li>
                            <li>Координатор</li>
                            <li>Генератор идей  </li>
                            <li>Исследователь</li>
                            <li>Исполнитель</li>
                            <li>Многие проблемы в командах можно рассматривать с точки зрения отсутствия/дисбаланса ролей. Ну и решения этих проблем, соответственно, находятся в добавлении/исключении ролей. В этом и состоит основная идея всей модели.</li>
                        </ul>
                        <h6 class="roles-content__title">Совмещение ролей.</h6>
                        <p class="roles-content__text">Роли по Белбину – это не функции и не задачи.  Человеку они просто свойственны, его психотипу, его желаниям. И потому, как правило, человек просто будет исполнять ту роль (или несколько ролей), которые ему по душе, независимо от мотивации или регламентов.  Переделать роль человека практически невозможно, да и дело это, надо сказать, неблагодарное. Конечно, между ролями нет бетонного забора. Есть масса похожих ролей.Человек исполняет сразу несколько ролей.  И от баланса этих ролей, во многом, зависит возможность команды быть настоящей командой, а не просто группой лиц по предварительному сговору)</p>
                        <h6 class="roles-content__title">Как определить? </h6>
                        <p class="roles-content__text">Чтобы правильно выявить предпочитаемую человеком командную роль, рекомендуется проводить комплексное тестирование по трём блокам: мотивация, интеллект и личность. Если оценивать сотрудника с помощью какого-то одного теста — прогноз его поведения в команде может оказаться недостоверным.</p>
                        <p class="roles-content__text">Для разных ролей важны разные факторы.Например, чтобы выявить Генератора идей, нужно оценить личность человека, его интеллект и мотивацию. В то время как для определения Реализатора достаточно оценить только мотивацию и личность. При этом с помощью тестирования нельзя узнать о прошлом опыте сотрудника и его степени освоения командной роли. </p>
                        <p class="roles-content__text">Для решения этой задачи используется гибридная технология оценки, где тестирование совмещается с интервью с экспертом.
                            Тест оценивает мотивацию, интеллект и личность, а эксперт, в личной беседе, выясняет прошлый опыт сотрудника, командную роль, которую человек выбирал на предыдущем месте работы и причины этого выбора. В результате комплексной оценки складывается полная картина о сотруднике, — его потенциале, способностях и личностных особенностях.
                        </p>
                    </div>  
                    <div class="time__btns">
                        <light-button 
                            class="time__btns-light"
                            @click="router.push('/culture')"
                            >вернуться
                        </light-button>
                        <my-button 
                            class="time__btns-dark"
                            @click="router.push('/books-4')"
                            >продолжить
                        </my-button>
                    </div>
                </div>
            </div>
        </div>
        <Navbar/>
    </main>
</template>

<script setup>
import Navbar from '@/components/Navbar.vue';
import Breadcrumbs from '@/components/Breadcrumbs.vue';
import { useRouter } from 'vue-router';
const router = useRouter();
</script>

<style lang="scss" scoped>
.roles{
    padding: 14px 0 80px;
    background-color: #fff;

    &__inner{
        display: flex;
        flex-direction: column;
        gap: 30px;
    }

    &__title{
        text-align: center;
        font-weight: 500;
        font-size: 16px;
    }

}

.roles-content{
    display: flex;
    flex-direction: column;
    gap: 8px;

    &__text{
        font-weight: 400;
        font-size: 14px;
    }

    &__title{
        font-weight: 500;
    }

    &__img{
        width: 100%;
    }

    &__list{
        display: flex;
        flex-direction: column;
        gap: 5px;
        padding-left: 40px;

        li{
            font-weight: 400;
            font-size: 14px;
        }
    }
}
</style>